Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: The `default-kafka-broker` configuration map contains all application properties prefixed with `kafka.` or `KAFKA_`. For more configuration options check out <<kafka-configuration-resolution>>.
ja_jp: `default-kafka-broker` 設定マップには、 `kafka.` または `KAFKA_` で始まるすべてのアプリケーションプロパティーが含まれます。 その他の設定オプションについては、<<kafka-configuration-resolution>> を参照してください。

source: The `deleteEntity` method can only be accessed if the first `SecurityIdentity` has the `admin` role. <<authentication-mechanisms-priority, Configure the mechanism priority>> to impact which authentication mechanism is used to produce the first `SecurityIdentity`.
ja_jp: `deleteEntity` メソッドには、最初の `SecurityIdentity` が `admin` ロールを持つ場合にのみアクセスできます。最初の `SecurityIdentity` を生成するためにどの認証メカニズムが使用されるかに影響を与えるには、<<authentication-mechanisms-priority, メカニズムの優先度を設定>> してください。

source: The `dependencyCondition` element may contain more than `artifact`, in which case all the configured artifacts must be present on the classpath for the condition to be satisfied.
ja_jp: `dependencyCondition` 要素には `artifact` が複数含まれる場合があります。その場合、条件を満たすには、設定されたすべてのアーティファクトがクラスパス上に存在している必要があります。

source: The `description` parameter will contain the data contained in the part of HTTP request called `description` (because link:{resteasy-reactive-common-api}/org/jboss/resteasy/reactive/RestForm.html[`@RestForm`] does not define a value, the field name is used), while the `file` parameter will contain data about the uploaded file in the `image` part of HTTP request, and the `person` parameter will read the `Person` entity using the `JSON` <<json,body reader>>.
ja_jp: `description` パラメーターには、HTTP リクエストの `description` という部分に含まれるデータが格納されます（link:{resteasy-reactive-common-api}/org/jboss/resteasy/reactive/RestForm.html[`@RestForm`] が値を定義していない場合は、フィールド名が使用されるため）。一方、 `file` パラメータは、HTTP リクエストの `image` 部分にアップロードされたファイルに関するデータを含み、 `person` パラメーターは、 `JSON` xref:json[ボディーリーダー] を使用して `Person` エンティティーを読み込みます。

source: The `description` parameter will contain the data contained in the part of HTTP request called `description` (because link:{resteasy-reactive-common-api}/org/jboss/resteasy/reactive/RestForm.html[`@RestForm`] does not define a value, the field name is used), while the `file` parameter will contain data about the uploaded file in the `image` part of HTTP request, and the `person` parameter will read the `Person` entity using the `JSON` xref:json[body reader].
ja_jp: `description` パラメーターには、HTTP リクエストの `description` という部分に含まれるデータが格納されます（なぜなら link:{resteasy-reactive-common-api}/org/jboss/resteasy/reactive/RestForm.html[@RestForm] が値を定義していない場合は、フィールド名が使用される為です）。一方、 `file` パラメータは、HTTP リクエストの `image` 部分にアップロードされたファイルに関するデータを含み、 `person` パラメータは、 `JSON` xref:json[ボディリーダー] を使用して `Person` エンティティを読み込みます。

source: The `description` will be also resolved against the `item.parent`.
ja_jp: `description` も `item.parent` に対して解決されます。

source: The `doSomething` method has been annotated with `@PreAuthorize` using an expression that indicates that method `check` of a bean named `personChecker` needs to be invoked to determine whether the current user is authorized to invoke the `doSomething` method.
ja_jp: `doSomething` メソッドは、現在のユーザーが `doSomething` メソッドを呼び出すことを許可されているかどうかを判断するために、 `personChecker`という名前の Bean のメソッド `check` を呼び出す必要があることを示す式を使用して、 `@PreAuthorize` のアノテーションが付けられています。

source: The `docker` or `podman` CLI present in the `$PATH`
ja_jp: `$PATH` に存在する `docker` または `podman` CLI

source: The `docs` module has a JUnit 5 test that will run the Vale linter in a container (using https://www.testcontainers.org/[Testcontainers]). It verifies both Quarkus document metadata and Vale style rules.
ja_jp: `docs` モジュールには、JUnit 5 テストがあり、コンテナ内で Vale リンターを実行します（ link:https://www.testcontainers.org/[Testcontainers] を使用）。QuarkusドキュメントのメタデータとValeスタイルルールの両方が検証されます。

source: The `docs` module has a JUnit test that will run the Vale linter in a container (using https://www.testcontainers.org/[Testcontainers]). It verifies both Quarkus document metadata and Vale style rules.
ja_jp: `docs` モジュールには、コンテナー内で Vale リンターを実行する JUnit テストがあります (https://www.testcontainers.org/[Testcontainers] を使用)。これにより、Quarkus ドキュメントのメタデータと Vale スタイルルールの両方が検証されます。

source: The `dynamic-graphql-client-2` GraphQL client calls have the `Authorization` header with an access token acquired by the `oidc-client-for-graphql-2` OIDC client.
ja_jp: `dynamic-graphql-client-2` GraphQL クライアントの呼び出しには、`oidc-client-for-graphql-2` OIDC クライアントによって取得されたアクセストークンを含む `Authorization` ヘッダーがあります。

source: The `echo:name` permission will be included in the access token as a standard OAuth2 `scope` claim value if this scope will also be requested during the authorization code flow. Update the configuration as follows:
ja_jp: `echo:name` 権限は、認可コードフロー中に標準 Oauth2 `scope` もリクエストされた場合、 `echo:name` 権限が標準の OAuth2 `scope` クレーム値としてアクセストークンに含まれます。次のように設定を更新します。

source: The `elytron-security-jdbc` extension requires at least one datasource to access to your database.
ja_jp: `elytron-security-jdbc` エクステンションは、データベースにアクセスするために少なくとも一つのデータソースが必要です。

source: The `elytron-security-jdbc` extension requires at least one principal query to authenticate the user and its identity.
ja_jp: `elytron-security-jdbc` エクステンションは、ユーザーとそのアイデンティティを認証するために、少なくとも一つのプリンシパルのクエリを必要とします。

source: The `elytron-security-ldap` extension requires a dir-context and an identity-mapping with at least one attribute-mapping to authenticate the user and its identity.
ja_jp: `elytron-security-ldap` エクステンションでは、ユーザーとそのアイデンティティを認証するために、 dir-context と、少なくとも一つの属性マッピングを持つ アイデンティティマッピング が必要です。

source: The `enc` (content encryption) header defaults to `A256GCM`.
ja_jp: `enc` (コンテンツ暗号化) ヘッダーのデフォルトは `A256GCM` です。

source: The `end = false` element on the bookTrip method forces the LRA to continue running when the method finishes and the `end = true` element on the confirmTrip method forces the LRA (started by the bookTrip method) to be closed when the method finishes. Note that this end element can be placed on any JAX-RS resource (ie one service can start the LRA whilst a different service ends it). There are many more examples in the https://github.com/eclipse/microprofile-lra/blob/master/spec/src/main/asciidoc/microprofile-lra-spec.adoc#java-annotations[Microprofile LRA specification document] and in the https://github.com/eclipse/microprofile-lra/tree/master/tck/src/main/java/org/eclipse/microprofile/lra/tck[Microprofile LRA TCK].
ja_jp: bookTripメソッドの `end = false` 要素は、メソッドが終了したときにLRAの実行を継続させ、confirmTripメソッドの `end = true` 要素は、メソッドが終了したときに（bookTripメソッドによって開始された）LRAを強制的に終了させます。このend要素は、どのJAX-RSリソースにも配置できることに注意してください（つまり、あるサービスがLRAを開始し、別のサービスがそれを終了させることができます）。 link:https://github.com/eclipse/microprofile-lra/blob/master/spec/src/main/asciidoc/microprofile-lra-spec.adoc#java-annotations[Microprofile LRA仕様]および link:https://github.com/eclipse/microprofile-lra/tree/master/tck/src/main/java/org/eclipse/microprofile/lra/tck[Microprofile LRA TCK]には、さらに多くの例があります。

source: The `end = false` element on the bookTrip method forces the LRA to continue running when the method finishes and the `end = true` element on the confirmTrip method forces the LRA (started by the bookTrip method) to be closed when the method finishes. Note that this end element can be placed on any JAX-RS resource (ie one service can start the LRA whilst a different service ends it). There are many more examples in the https://github.com/eclipse/microprofile-lra/blob/master/spec/src/main/asciidoc/microprofile-lra-spec.asciidoc#java-annotations-for-lras[Microprofile LRA specification document] and in the https://github.com/eclipse/microprofile-lra/tree/master/tck/src/main/java/org/eclipse/microprofile/lra/tck[Microprofile LRA TCK].
ja_jp: bookTripメソッドの `end = false` 要素は、メソッドが終了したときにLRAの実行を継続させ、confirmTripメソッドの `end = true` 要素は、メソッドが終了したときに（bookTripメソッドによって開始された）LRAを強制的に終了させます。このend要素は、どのJAX-RSリソースにも配置できることに注意してください（つまり、あるサービスがLRAを開始し、別のサービスがそれを終了させることができます）。 https://github.com/eclipse/microprofile-lra/blob/master/spec/src/main/asciidoc/microprofile-lra-spec.asciidoc#java-annotations-for-lras[Microprofile LRA仕様]および https://github.com/eclipse/microprofile-lra/tree/master/tck/src/main/java/org/eclipse/microprofile/lra/tck[Microprofile LRA TCK]には、さらに多くの例があります。

source: The `end = false` element on the bookTrip method forces the LRA to continue running when the method finishes and the `end = true` element on the confirmTrip method forces the LRA (started by the bookTrip method) to be closed when the method finishes. Note that this end element can be placed on any Jakarta REST resource (ie one service can start the LRA whilst a different service ends it). There are many more examples in the https://github.com/eclipse/microprofile-lra/blob/master/spec/src/main/asciidoc/microprofile-lra-spec.asciidoc#java-annotations-for-lras[Microprofile LRA specification document] and in the https://github.com/eclipse/microprofile-lra/tree/master/tck/src/main/java/org/eclipse/microprofile/lra/tck[Microprofile LRA TCK].
ja_jp: bookTripメソッドの `end = false` 要素は、メソッドの終了時にLRAの実行を継続させ、confirmTripメソッドの `end = true` 要素は、メソッドの終了時にLRA（bookTripメソッドで開始）を終了させます。この終了要素は、Jakarta RESTリソースに置くことができることに注意してください（つまり、あるサービスがLRAを開始し、別のサービスがそれを終了することもできます）。 link:https://github.com/eclipse/microprofile-lra/blob/master/spec/src/main/asciidoc/microprofile-lra-spec.asciidoc#java-annotations-for-lras[Microprofile LRA仕様] とlink:https://github.com/eclipse/microprofile-lra/tree/master/tck/src/main/java/org/eclipse/microprofile/lra/tck[Microprofile LRA TCK] には、この他にも多くの例が掲載されています。

source: The `event` object represents the transaction ID, and defines `toString()`/`equals()`/`hashCode()` accordingly.
ja_jp: `event` オブジェクトはトランザクション ID を表し、それに応じて `toString()` / `equals()` / `hashCode()` を定義しています。

source: The `every` attribute supports <<config-reference#property-expressions,Property Expressions>> including default values and nested Property Expressions. (Note that `"{property.path}"` style expressions are still supported but don't offer the full functionality of Property Expressions.)
ja_jp: `every` 属性は、デフォルト値とネストされた値プロパティー式を含む<<config-reference#property-expressions,Property Expressions>> をサポートします。 ("{property.path}" スタイルの式は引き続きサポートされますが、プロパティー式の機能がすべて提供されるわけではありません。)

source: The `every` attribute supports xref:config-reference.adoc#property-expressions[Property Expressions] including default values and nested Property Expressions. (Note that `"{property.path}"` style expressions are still supported but don't offer the full functionality of Property Expressions.)
ja_jp: `every` 属性は、デフォルト値やネストされたProperty Expressionを含む xref:config-reference.adoc#property-expressions[プロパティ式] に対応しています。(なお、 `"{property.path}"` スタイル式はまだサポートされていますが、プロパティ式の全機能を提供するものではありません。)

source: The `execute` and `cancel` methods now receive an `AgentEmitter` parameter instead of `EventQueue`:
ja_jp: `execute` および `cancel` メソッドは、 `EventQueue` の代わりに `AgentEmitter` パラメーターを受け取るようになりました。

source: The `execute` method sends the command to Redis and retrieves the `Response`. The command name is passed as first parameters. You can add an arbitrary number of **String** parameters to your command. The result is wrapped into a `Response` object.
ja_jp: `execute` メソッドは Redis にコマンドを送信し、 `Response` を取得します。コマンド名は最初のパラメーターとして渡されます。コマンドには、任意の数の **String** パラメーターを追加することができます。結果は `Response` オブジェクトにラップされます。

source: The `extension-descriptor` goal will generate `META-INF/quarkus-extension.properties` with the corresponding properties. And once an application that has a dependency on this extension is launched in Dev mode, the logs will look like
ja_jp: `extension-descriptor` は、対応するプロパティーを持つ `META-INF/quarkus-extension.properties` を生成することが目的です。 また、このエクステンションに依存するアプリケーションが開発モードで起動されると、ログは次のとおりです。

source: The `fast-jar` packaging results in creating an artifact that starts a little faster and consumes slightly less memory than a legacy Quarkus jar because it has indexed information about which dependency jar contains classes and resources. It can thus avoid the lookup into potentially every jar on the classpath that the legacy jar necessitates, when loading a class or resource.
ja_jp: `fast-jar` パッケージングでは、どの依存関係のjarにクラスやリソースが含まれているかという情報がインデックス化されているため、レガシーのQuarkus jarよりも起動が少し速く、メモリ消費量もわずかに少ないアーティファクトを作成できます。このため、クラスやリソースをロードする際に、 レガシー jar が必要とするクラスパス上のすべての jar を検索する必要がなくなります。

source: The `film` query method requested fields can be determined as such in our previous example. This way we can retrieve individual film information.
ja_jp: 先ほどの例では、 `film` というクエリメソッドの要求フィールドがそのように決定できます。このようにして、個々の映画の情報を取得することができます。

source: The `foo` cache is being configured.
ja_jp: `foo` キャッシュの設定を行っています。

source: The `foo` configuration profile will be used to run the tests.
ja_jp: `foo` 設定プロファイルがテストの実行に使用されます。

source: The `for` statement also works with integers, starting from 1. In the example below, considering that `total = 3`:
ja_jp: `for` 文は、1 から始まる整数でも動作します。 以下の例では、 `total = 3` です。

source: The `fruits` parameter is not defined when the database is empty.
ja_jp: データベースが空の場合、 `fruits` パラメーターは定義されません。

source: The `get()` method allows retrieving the current value.
ja_jp: `get()` メソッドでは、現在の値を取得することができます。

source: The `getAll()` method above returns `Multi`, and the `add()` method returns `Uni`. These types are the same Mutiny types that we met before; they are automatically recognized by the Quarkus reactive REST API, so we don't need to convert them into JSON ourselves.
ja_jp: 上記の `getAll ()` メソッドは `Multi` を返し、 `add ()` メソッドは `Uni` を返します。これらのタイプは、以前使用した Mutiny タイプと同じで、Quarkus リアクティブ REST API により自動的に認識されるので、JSON に変換する必要はありません。

source: The `getById` method above is a blocking call. It should not be invoked on the event loop. The <<async-support>> section describes how to make non-blocking calls.
ja_jp: 上記の `getById` メソッドはブロッキング呼び出しです。イベントループで呼び出さないでください。 <<async-support>> セクションでは、ノンブロッキング呼び出しを行う方法について説明しています。

source: The `getById` method above is a blocking call. It should not be invoked on the event loop. The xref:async-support[Async Support] section describes how to make non-blocking calls.
ja_jp: 上記の `getById` メソッドは、ブロッキング呼び出しです。イベントループ上で呼び出してはいけません。 xref:async-support[非同期サポート] の項では、ノンブロッキング呼び出しの方法について説明しています。

source: The `getById` method gives our code the ability to get an extension by id from the Code Quarkus API. The client will handle all the networking and marshalling leaving our code clean of such technical details.
ja_jp: `getById` メソッドは、私たちのコードに、Code Quarkus API からidを指定してエクステンションを問い合わせる機能を与えます。クライアントがすべてのネットワーキングとマーシャリングを処理してくれるので、このような技術的な詳細は一切ありません。

source: The `getMetaData()` method is added to provide callers with a list of all the nodes in the application cluster.
ja_jp: アプリケーションクラスタ内の全ノードのリストを呼び出し元に提供するために `getMetaData()` メソッドが追加されました。

source: The `getProduct` callback method can only be invoked if the current security identity has an `admin` role or the user is allowed to get the product detail.
ja_jp: `getProduct` コールバックメソッドは、現在のセキュリティーアイデンティティーに `admin` ロールがある場合、またはユーザーが製品の詳細を取得することを許可されている場合にのみ、呼び出すことができます。

source: The `getTimeTable()` method returns the latest timetable from the database. It uses the `ScoreManager` (which is automatically injected) to calculate the score of that timetable, so the UI can show the score.
ja_jp: `getTimeTable()` メソッドは、データベースから最新のタイムテーブルを返します。 `ScoreManager` (自動的に挿入されます) を使用してそのタイムテーブルのスコアを計算するため、UI でスコアを表示できます。

source: The `get`, `update`, and `delete` methods use the path param "id" and as the field "id" exists in the entity type "Record", the web link properly populates the value "1" in the returned links. In addition to this, we can also generate web links with path params that do not match with any field of the entity type. For example, the following method is using a path param "text" and the entity Record does not have any field named "text":
ja_jp: `get `, `update `, `delete` の各メソッドでは、パスパラメータ "id" を使用しており、エンティティタイプ "Record" にフィールド "id" が存在するため、Web リンクは返されるリンクに適切に値 "1" を入力します。これに加えて、エンティティ・タイプのどのフィールドとも一致しないパス・パラメータを持つウェブ・リンクを生成することも可能です。たとえば、次のメソッドでは、パスパラメータ "text" を使用していますが、エンティティRecordには "text" という名前のフィールドがありません:

source: The `global:` namespace is used; `age` resolves to `Globals#age`.
ja_jp: `global:` 名前空間が使用され、`age` は `Globals#age` に解決されます。

source: The `greeting-extension` extension has to be installed in the local Maven repository to be usable in the application.
ja_jp: `quarkus-greeting` エクステンションをアプリケーションで使用できるようにするには、ローカルの Maven リポジトリにインストールする必要があります。

source: The `group` claim provides the groups and top-level roles associated with the JWT bearer.
ja_jp: `group` クレームは、JWT ベアラーに関連付けられたグループとトップレベルのロールを提供します。

source: The `grpc.codegen.skip` system property: `-Dgrpc.codegen.skip=true`
ja_jp: `grpc.codegen.skip` システムプロパティー: `-Dgrpc.codegen.skip=true`

source: The `http://localhost:8080/api/admin` endpoint can only be accessed by users with the `admin` role. If you try to access this endpoint with the previously issued access token, you should get a `403` response from the server.
ja_jp: `http://localhost:8080/api/admin` エンドポイントは、 `admin` ロールを持つユーザーのみがアクセスできます。以前に発行されたアクセストークンを使用してこのエンドポイントにアクセスしようとすると、サーバーから `403` 応答が返ってくるはずです。

source: The `http://localhost:8080/api/admin` endpoint is restricted to users with the `admin` role. If you try to access this endpoint with the previously issued access token, the server returns a `403 Forbidden` response:
ja_jp: `http://localhost:8080/api/admin` エンドポイントは、 `admin` ロールを持つユーザーに制限されています。 以前に発行されたアクセストークンを使用してこのエンドポイントにアクセスしようとすると、サーバーは `403 Forbidden` レスポンスを返します。

source: The `https://quarkus-auth0` identifier of the created `QuarkusAuth0API` will serve as this API's `audience`. Providing this audience as a query parameter in the authorization code flow redirect to Auth0 will ensure that Auth0 issues access tokens in the JWT format.
ja_jp: 作成された `QuarkusAuth0API` の `https://quarkus-auth0` 識別子は、この API の `audience` として機能します。Auth0 への認可コードフローリダイレクトでこのオーディエンスをクエリーパラメーターとして提供すると、Auth0 は必ず JWT フォーマットでアクセストークンを発行するようになります。

source: The `hybrid` OIDC application type will ensure that `http://localhost:8080/hello` requests to `GreetingResource` initiate an Authorization code flow while `http://localhost:8080/echo` requests to `ApiEchoService`, initiated by `GreetingResource`, will lead to the authorization code flow tokens being propagated and accepted by `ApiEchoService` as bearer JWT access tokens.
ja_jp: `hybrid` OIDC アプリケーションタイプでは、 `GreetingResource` への `http://localhost:8080/hello` リクエストによって認可コードフローが開始されます。一方で、、 `GreetingResource` によって開始された `ApiEchoService` への `http://localhost:8080/echo` リクエストによって、認可コードフロートークンが伝播され、ベアラー JWT アクセストークンとして `ApiEchoService` によって受け入れられます。

source: The `hybrid` application type can be used to support both bearer access token and authorization code flows at the same time. If the current request has an HTTP `Authorization: Bearer <token>` header then the bearer access token is verified, otherwise, if no session cookie is available, the user is redirected to the OIDC provider to authenticate.
ja_jp: `hybrid` アプリケーションタイプは、ベアラーアクセストークンフローと認可コードフローの両方を同時にサポートするために使用できます。 現在のリクエストに HTTP `Authorization: Bearer <token>` ヘッダーがある場合はベアラーアクセストークンが検証され、それ以外の場合でセッションクッキーが利用できない場合は、ユーザーは認証のために OIDC プロバイダーにリダイレクトされます。

source: The `identity` attribute supports <<config-reference#property-expressions,Property Expressions>> including default values and nested Property Expressions. (Note that `"{property.path}"` style expressions are still supported but don't offer the full functionality of Property Expressions.)
ja_jp: `identity` 属性は、デフォルト値とネストされた値プロパティー式を含む<<config-reference#property-expressions,Property Expressions>> をサポートします。 ("{property.path}" スタイルの式は引き続きサポートされますが、プロパティー式の機能がすべて提供されるわけではありません。)

source: The `identity` attribute supports xref:config-reference.adoc#property-expressions[Property Expressions] including default values and nested Property Expressions. (Note that `"{property.path}"` style expressions are still supported but don't offer the full functionality of Property Expressions.)
ja_jp: `identity` 属性は、デフォルト値やネストされたProperty Expressionを含む xref:config-reference.adoc#property-expressions[プロパティ式] に対応しています。(なお、 `"{property.path}"` スタイル式はまだサポートされていますが、プロパティ式の全機能を提供するものではありません。)

source: The `idle-timeout` is disabled by default.
ja_jp: `idle-timeout` はデフォルトで無効になっています。

source: The `if` section represents a basic control flow section. The simplest possible version accepts a single parameter and renders the content if the condition is evaluated to `true`. A condition without an operator evaluates to `true` if the value is not considered `falsy`, i.e. if the value is not `null`, `false`, an empty collection, an empty map, an empty array, an empty string/char sequence or a number equal to zero.
ja_jp: `if` セクションは、基本的な制御フローセクションを表しています。最も単純なバージョンでは、単一のパラメーターを受け取り、条件が `true` と評価された場合にコンテンツをレンダリングします。演算子なしの条件は値が `falsy` (つまり、 `null` 、 `false` 、空のコレクション、空のマップ、空の配列、空の文字列/文字列シーケンス、またはゼロに等しい数) ではない場合、 `true` と評価されます。

source: The `image build` command can be used directly, or a subcommand can be selected. The available subcommands are:
ja_jp: `image build` コマンドを直接使用することも、サブコマンドを選択することもできます。使用可能なサブコマンドは次のとおりです。

source: The `imagePullPolicy` can also be configured:
ja_jp: `imagePullPolicy` の設定も可能です：

source: The `index.hbs` has been renamed to the `index.html` Qute template and moved to the `src/main/resources/META-INF/resources/` directory, its content remains the same.
ja_jp: `index.hbs` は `index.html` という Qute テンプレートに名前が変更され、 `src/main/resources/META-INF/resources/` ディレクトリーに移動されましたが、内容は同じままです。

source: The `index.html` Qute template in the `src/main/resources/META-INF/resources/` directory and the `userEmail.html` Qute template in the `src/main/templates` directory remain unchanged.
ja_jp: `src/main/resources/META-INF/resources/` ディレクトリーの `index.html` Qute テンプレートと、 `src/main/templates` ディレクトリーの `userEmail.html` Qute テンプレートは変更されません。

source: The `index` after `quarkus.http.filter` in the key is used for grouping and (as an example) can be named as you like.
ja_jp: キーの `quarkus.http.filter` の後の `index` はグループ分けに使用され、 ( 例として ) 好きな名前を付けることができます。

source: The `init` method receives an `Instance<MyVerticle>`. Then, you pass a supplier to the `deployVerticle` method. The supplier is just calling the `get()` method. Thanks to the `@Dependent` scope, it returns a new instance on every call. Finally, you pass the desired number of instances to the `DeploymentOptions`, such as two in the previous example. It will call the supplier twice, which will create two instances of your verticle.
ja_jp: `init` メソッドは、 `Instance<MyVerticle>` を受け取ります。そして、 `deployVerticle` メソッドにサプライヤーを渡します。サプライヤーは `get()` メソッドを呼び出しているだけです。 `@Dependent` スコープのおかげで、呼び出すたびに新しいインスタンスが返されます。最後に、必要な数のインスタンスを `DeploymentOptions` に渡します。たとえば、前の例では 2 つです。サプライヤーを 2 回呼び出し、Verticle の 2 つのインスタンスを作成します。

source: The `invoke` method does not change the event, except in one case. If the `invoke` callback throws an exception, the downstream does not get the actual event but get a failure event instead.
ja_jp: `invoke` メソッドは、1 つのケースを除いて、イベントを変更しません。 `invoke` コールバックが例外をスローした場合、ダウンストリームは実際のイベントを取得せず、代わりに失敗イベントを取得します。

source: The `invoke` method is synchronous and does not return anything. Mutiny invokes the configured callback when the observed stream dispatches the event:
ja_jp: `invoke` メソッドは同期で、何も戻りません。Mutinyは、観測されたストリームがイベントをディスパッチするときに、設定されたコールバックを呼び出します。
